-- phpMyAdmin SQL Dump
-- version 4.7.7
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Время создания: Янв 11 2018 г., 20:29
-- Версия сервера: 10.1.29-MariaDB
-- Версия PHP: 7.0.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `u279500796_smtrn`
--

-- --------------------------------------------------------

--
-- Структура таблицы `tests`
--

CREATE TABLE `tests` (
  `id` int(11) NOT NULL,
  `nick` text COLLATE utf8_unicode_ci NOT NULL,
  `name` text COLLATE utf8_unicode_ci NOT NULL,
  `disablechoice` tinyint(1) NOT NULL,
  `data` mediumtext COLLATE utf8_unicode_ci NOT NULL,
  `active` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `tests`
--

INSERT INTO `tests` (`id`, `nick`, `name`, `disablechoice`, `data`, `active`) VALUES
(1, 'AncientWorld', 'Древний мир', 0, '[{\\\"q\\\":\\\"Как называется данное здание?\\\",\\\"img\\\":\\\"1.jpg\\\",\\\"as\\\":[\\\"Храм Ники Аптерос\\\",\\\"Эрехтейон\\\",\\\"Парфенон\\\",\\\"Античный театр\\\"]},{\\\"q\\\":\\\"Как называется данное здание?\\\",\\\"img\\\":\\\"2.jpg\\\",\\\"as\\\":[\\\"Эрехтейон\\\",\\\"Храм Ники Аптерос\\\",\\\"Парфенон\\\",\\\"Античный театр\\\"]},{\\\"q\\\":\\\"Как называется колонна в виде женской фигуры? (Эрехтейон)\\\",\\\"img\\\":\\\"22.jpg\\\",\\\"as\\\":[\\\"Кариатида\\\"]},{\\\"q\\\":\\\"Как называется данное здание?\\\",\\\"img\\\":\\\"3.jpg\\\",\\\"as\\\":[\\\"Парфенон\\\",\\\"Храм Ники Аптерос\\\",\\\"Эрехтейон\\\",\\\"Античный театр\\\"]},{\\\"q\\\":\\\"Как называется данное здание?\\\",\\\"img\\\":\\\"4.jpg\\\",\\\"as\\\":[\\\"Античный театр\\\",\\\"Храм Ники Аптерос\\\",\\\"Эрехтейон\\\",\\\"Парфенон\\\"]},{\\\"q\\\":\\\"Как называется данное место?\\\",\\\"img\\\":\\\"5.jpg\\\",\\\"as\\\":[\\\"Акрополь\\\"]},{\\\"q\\\":\\\"Как называется данная скульптура?\\\",\\\"img\\\":\\\"6.jpg\\\",\\\"as\\\":[\\\"Большой сфинкс\\\"]},{\\\"q\\\":\\\"Назовите плато, на котором была сделана эта фотография.\\\",\\\"img\\\":\\\"6.jpg\\\",\\\"as\\\":[\\\"Гиза\\\"]},{\\\"q\\\":\\\"Чей бюст здесь изображён?\\\",\\\"img\\\":\\\"7.jpg\\\",\\\"as\\\":[\\\"Нефертити\\\"]},{\\\"q\\\":\\\"Какой архитектурный ордер здесь изображён?\\\",\\\"img\\\":\\\"8.jpg\\\",\\\"as\\\":[\\\"Дорический\\\",\\\"Ионический\\\",\\\"Коринфский\\\"]},{\\\"q\\\":\\\"Какой архитектурный ордер здесь изображён?\\\",\\\"img\\\":\\\"9.jpg\\\",\\\"as\\\":[\\\"Ионический\\\",\\\"Дорический\\\",\\\"Коринфский\\\"]},{\\\"q\\\":\\\"Какой архитектурный ордер здесь изображён?\\\",\\\"img\\\":\\\"10.jpg\\\",\\\"as\\\":[\\\"Коринфский\\\",\\\"Дорический\\\",\\\"Ионический\\\"]},{\\\"q\\\":\\\"Чья маска здесь изображена?\\\",\\\"img\\\":\\\"11.jpg\\\",\\\"as\\\":[\\\"Тутанхамон\\\"]},{\\\"q\\\":\\\"Кому посвящена данная пирамида?\\\",\\\"img\\\":\\\"12.jpg\\\",\\\"as\\\":[\\\"Джосер\\\",\\\"Хеопс\\\",\\\"Хефрен\\\",\\\"Микерин\\\"]},{\\\"q\\\":\\\"Кому посвящена пирамида слева?\\\",\\\"img\\\":\\\"13.jpg\\\",\\\"as\\\":[\\\"Хеопс\\\",\\\"Джосер\\\",\\\"Хефрен\\\",\\\"Микерин\\\"]},{\\\"q\\\":\\\"Кому посвящена пирамида посередине?\\\",\\\"img\\\":\\\"13.jpg\\\",\\\"as\\\":[\\\"Хефрен\\\",\\\"Хеопс\\\",\\\"Джосер\\\",\\\"Микерин\\\"]},{\\\"q\\\":\\\"Кому посвящена пирамида справа?\\\",\\\"img\\\":\\\"13.jpg\\\",\\\"as\\\":[\\\"Микерин\\\",\\\"Хефрен\\\",\\\"Хеопс\\\",\\\"Джосер\\\"]},{\\\"q\\\":\\\"Где расположен данный храм?\\\",\\\"img\\\":\\\"14.jpg\\\",\\\"as\\\":[\\\"Карнак\\\"]},{\\\"q\\\":\\\"Где расположен данный храм?\\\",\\\"img\\\":\\\"15.jpg\\\",\\\"as\\\":[\\\"Луксор\\\"]},{\\\"q\\\":\\\"Как называется данная скульптура?\\\",\\\"img\\\":\\\"16.jpg\\\",\\\"as\\\":[\\\"Венера Милосская\\\",\\\"Ника Самофракийская\\\",\\\"Афина Парфенос\\\",\\\"Афродита Книдская\\\"]},{\\\"q\\\":\\\"Как называется данная скульптура?\\\",\\\"img\\\":\\\"17.jpg\\\",\\\"as\\\":[\\\"Дискобол\\\"]},{\\\"q\\\":\\\"Кто является автором данной скульптуры?\\\",\\\"img\\\":\\\"17.jpg\\\",\\\"as\\\":[\\\"Мирон\\\",\\\"Поликлет\\\",\\\"Фидий\\\",\\\"Протоген\\\"]},{\\\"q\\\":\\\"Как называется данная скульптура?\\\",\\\"img\\\":\\\"18.jpg\\\",\\\"as\\\":[\\\"Ника Самофракийская\\\",\\\"Афина Парфенос\\\",\\\"Афродита Книдская\\\",\\\"Венера Милосская\\\"]},{\\\"q\\\":\\\"Как называется данная скульптура?\\\",\\\"img\\\":\\\"19.jpg\\\",\\\"as\\\":[\\\"Аполлон Бельведерский\\\",\\\"Август из Прима-Порта\\\",\\\"Апоксиомен\\\",\\\"Дорифор\\\"]},{\\\"q\\\":\\\"Как называется данный скульптурный портрет?\\\",\\\"img\\\":\\\"20.jpg\\\",\\\"as\\\":[\\\"Римский\\\",\\\"Древнегреческий\\\",\\\"Фаюмский\\\",\\\"Древнеегипетский\\\"]},{\\\"q\\\":\\\"Как называется данный портрет?\\\",\\\"img\\\":\\\"21.jpg\\\",\\\"as\\\":[\\\"Фаюмский\\\",\\\"Римский\\\",\\\"Древнегреческий\\\",\\\"Древнеегипетский\\\"]}]', 1),
(2, 'Paintings', 'Шедевры живописи', 0, '[{\\\"q\\\":\\\"Варианты?\\\",\\\"img\\\":\\\"10.jpg\\\",\\\"as\\\":[\\\"В1\\\",\\\"В2\\\",\\\"В3\\\",\\\"В4\\\"]},{\\\"q\\\":\\\"Слово?\\\",\\\"img\\\":\\\"1.jpg\\\",\\\"as\\\":[\\\"Слово\\\"]}]', 1),
(3, 'MiddleAgesAndRevival', 'Средневековье и Возрождение', 0, '[]', 1),
(4, 'CraftsOfRussia', 'Народные промыслы', 0, '[]', 1),
(5, 'Art19', 'Искусство XIX века', 0, '[]', 1),
(6, 'Barocco', 'Барокко', 0, '[]', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `login` text NOT NULL,
  `password` text NOT NULL,
  `email` text NOT NULL,
  `hash` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `password`, `email`, `hash`) VALUES
(1, 'mrgeorgeous', 'admin', 'admin@localhost', ''),
(2, 'kurdom', 'kurdom', 'admin@localhost', '');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `tests`
--
ALTER TABLE `tests`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `tests`
--
ALTER TABLE `tests`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
